import 'package:ahd/Theme/color_managment.dart';
import 'package:flutter/material.dart';

class AboutInApp extends StatelessWidget {
  const AboutInApp({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: AppColors.white,
      appBar: AppBar(
        backgroundColor: AppColors.blu,
        centerTitle: true,
        title: Text(
          "عن حصيلة",
          style: TextStyle(color: AppColors.white),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Padding(
              padding: const EdgeInsets.all(25),
              child: Text(
                "تعميم نص يسمى الترام الأصفر أو90في بعض الوكالات في  المترو الأصفر معقولة استبدال أبجد هوز لإعطاء نظرة أكثر حداثة المحتوى. ولكن الكثير من الناس كانوا يبحثون لقراءة النص عندما كان في الفرنسية أو الإنجليزية، لم يتحقق التأثير المطلوب. العمل مع نص مقروء، التي تحتوي على الاتجاهات يمكن أن يسبب التشتت وهذا يمكن أن يساعد على التركيز علىالتخطيط. الاستفادة من أصل لاتيني والمحتوى هراء أبجد هوز يمنع القارئ من الهاء مضمون النص، وبالتالي يمكن أن تركز اهتمامها على تصميم الرسوم البيانية. والواقع أن النص أبجد هوز لديه ميزة في المقابل إلى نص عام باستخدام متغير طول كلمة لمحاكاة الإشغال الطبيعي للنموذج بحيث يطابق المنتج النهائيوضمان نشر دون تغيير في المستقبل.",
                style: TextStyle(color: AppColors.text, fontSize: 14),
              ),
            ),
            SizedBox(
              height: 30,
            ),
            Padding(
              padding: const EdgeInsets.all(25),
              child: Text(
                "تعميم نص يسمىالترام الأصفر أو90في بعض الوكالات في  المترو الأصفر معقولة استبدال أبجد هوز لإعطاء نظرة أكثر حداثة المحتوى. ولكن الكثير من الناس كانوا يبحثون لقراءة النص عندما كان في الفرنسية أو الإنجليزية، لم يتحقق التأثير المطلوب. العمل مع نص مقروء، التي تحتوي على الاتجاهات يمكن أن يسبب التشتت وهذا يمكن أن يساعد على التركيز علىالتخطيط. الاستفادة من أصل لاتيني والمحتوى هراء أبجد هوز يمنع القارئ من الهاء مضمون النص، وبالتالي يمكن أن تركز اهتمامها على تصميم الرسوم البيانية. والواقع أن النص أبجد هوز لديه ميزة في المقابل إلى نص عام باستخدام متغير طول كلمة لمحاكاة الإشغال الطبيعي للنموذج بحيث يطابق المنتج النهائيوضمان نشر دون تغيير في المستقبل.",
                style: TextStyle(color: AppColors.text, fontSize: 14),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(25),
              child: Align(
                alignment: Alignment.centerRight,
                child: Text(
                  "ملفات تعريف الارتباط وإشارات الويب",
                  style: TextStyle(
                      fontSize: 18,
                      color: AppColors.black,
                      fontWeight: FontWeight.bold),
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(25),
              child: Text(
                "تعميم نص يسمىالترام الأصفر أو90في بعض الوكالات في  المترو الأصفر معقولة استبدال أبجد هوز لإعطاء نظرة أكثر حداثة المحتوى. ولكن الكثير من الناس كانوا يبحثون لقراءة النص عندما كان في الفرنسية أو الإنجليزية، لم يتحقق التأثير المطلوب. العمل مع نص مقروء، التي تحتوي على الاتجاهات يمكن أن يسبب التشتت وهذا يمكن أن يساعد على التركيز علىالتخطيط. الاستفادة من أصل لاتيني والمحتوى هراء أبجد هوز يمنع القارئ من الهاء مضمون النص، وبالتالي يمكن أن تركز اهتمامها على تصميم الرسوم البيانية. والواقع أن النص أبجد هوز لديه ميزة في المقابل إلى نص عام باستخدام متغير طول كلمة لمحاكاة الإشغال الطبيعي للنموذج بحيث يطابق المنتج النهائيوضمان نشر دون تغيير في المستقبل.",
                style: TextStyle(color: AppColors.text, fontSize: 14),
              ),
            ),
            SizedBox(
              height: 30,
            ),
            Padding(
              padding: const EdgeInsets.all(25),
              child: Text(
                "تعميم نص يسمىالترام الأصفر أو90في بعض الوكالات في  المترو الأصفر معقولة استبدال أبجد هوز لإعطاء نظرة أكثر حداثة المحتوى. ولكن الكثير من الناس كانوا يبحثون لقراءة النص عندما كان في الفرنسية أو الإنجليزية، لم يتحقق التأثير المطلوب. العمل مع نص مقروء، التي تحتوي على الاتجاهات يمكن أن يسبب التشتت وهذا يمكن أن يساعد على التركيز علىالتخطيط. الاستفادة من أصل لاتيني والمحتوى هراء أبجد هوز يمنع القارئ من الهاء مضمون النص، وبالتالي يمكن أن تركز اهتمامها على تصميم الرسوم البيانية. والواقع أن النص أبجد هوز لديه ميزة في المقابل إلى نص عام باستخدام متغير طول كلمة لمحاكاة الإشغال الطبيعي للنموذج بحيث يطابق المنتج النهائيوضمان نشر دون تغيير في المستقبل.",
                style: TextStyle(color: AppColors.text, fontSize: 14),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
